<template>
  <v-card>
    <h2 class="d-flex align-center justify-center py-3">
      利用規約
    </h2>
    <v-divider></v-divider>
    <v-col>
      <v-responsive :aspect-ratio="16/9">
        <div class="px-lg-4 px-md-3 px-sm-2">
          <p class="mb-1">この利用規約（以下、「本規約」といいます。）は、このウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。本サービスのご利用ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って本サービスをご利用いただきます。</p>
          <br>
          <h3>第1条 適用</h3>
          <ol>
            <li>本規約は、ユーザーと管理者との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
            <li>管理者は、本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。 これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。</li>
            <li>本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。</li>
          </ol>
          <br>
          <h3>第2条 利用登録</h3>
          <ol>
            <li>本サービスにおいては登録希望者が本規約に同意の上、管理者の定める方法によって利用登録を申請し、管理者がこれを承認することによって利用登録が完了するものとします。</li>
            <li>管理者は、利用登録の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。</li>
            <ul>
              <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
              <li>本規約に違反したことがある者からの申請である場合</li>
              <li>その他、管理者が利用登録を相当でないと判断した場合</li>
            </ul>
          </ol>
          <br>
          <h3>第3条 禁止事項</h3>
          <p class="mb-1">ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
          <ul>
            <li>法令または公序良俗に違反する行為</li>
            <li>犯罪行為に関連する行為</li>
            <li>本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
            <li>管理者、ほかのユーザー、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
            <li>本サービスによって得られた情報を商業的に利用する行為</li>
            <li>管理者のサービスの運営を妨害するおそれのある行為</li>
            <li>不正アクセス、またはこれを試みる行為</li>
            <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
            <li>不正な目的を持って本サービスを利用する行為</li>
            <li>本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為</li>
            <li>他のユーザーに成りすます行為</li>
            <li>管理者が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
            <li>面識のない異性との出会いを目的とした行為</li>
            <li>管理者のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
            <li>その他、管理者が不適切と判断する行為</li>
          </ul>
          <br>
          <h3>第4条 本サービスの提供の停止等</h3>
          <ol>
            <li>管理者は、以下のいずれかの事由があると判断した場合、 ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</li>
            <ul>
              <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
              <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
              <li>コンピュータまたは通信回線等が事故により停止した場合</li>
              <li>その他、管理者が本サービスの提供が困難と判断した場合</li>
            </ul>
            <li>管理者は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。</li>
          </ol>
          <br>
          <h3>第5条 保証の否認および免責事項</h3>
          <ol>
            <li>管理者は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、 セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
            <li>管理者は、以下について一切の責任を負いません。</li>
            <ul>
              <li>Webカメラで撮影した画像の視聴に使用するPC、スマートフォン等の利用環境について生じた一切の不具合</li>
              <li>Webカメラの利用により利用者の発電設備およびその周辺機器に生じた不具合</li>
              <li>その他、本サービスに起因してユーザーに生じたあらゆる損害</li>
            </ul>
          </ol>
          <br>
          <h3>第6条 サービス内容の変更等</h3>
          <p class="mb-1">管理者は、ユーザーに通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、 これによってユーザーに生じた損害について一切の責任を負いません。</p>
          <br>
          <h3>第7条 利用規約の変更</h3>
          <p class="mb-1">管理者は、必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。 なお、本規約の変更後、本サービスの利用を開始した場合には、当該ユーザーは変更後の規約に同意したものとみなします。</p>
          <br>
          <h3>第8条 個人情報の取扱い</h3>
          <p class="mb-1">管理者は、本サービスの利用によって取得する個人情報については、管理者「プライバシーポリシー」に従い適切に取り扱うものとします。</p>
          <br>
          <h3>第9条 通知または連絡</h3>
          <p class="mb-1">ユーザーと管理者との間の通知または連絡は、管理者の定める方法によって行うものとします。</p>
          <br>
          <h3>第10条 権利義務の譲渡の禁止</h3>
          <p class="mb-1">ユーザーは、管理者の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。</p>
          <br>
          <h3>第11条 準拠法・裁判管轄</h3>
          <ol>
            <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
            <li>本サービスに関して紛争が生じた場合には、管理者の所在地を管轄する裁判所を専属的合意管轄とします。</li>
          </ol>
          <br>
          <p class="mt-4 mb-0">2022年7月8日 制定</p>
          <div class="d-flex justify-end">
            <p>以上</p>
          </div>
        </div>
      </v-responsive>
    </v-col>
    <v-divider></v-divider>
    <v-card-actions>
      <v-spacer></v-spacer>
      <v-btn
        color="blue darken-1"
        text
        @click="resetDialog()"
      >
        CLOSE
      </v-btn>
    </v-card-actions>
  </v-card>
</template>

<script>
export default {
  props: {
    dialog: Boolean,
  },
  watch: {
    dialog() {
      if (!this.dialog) {
        this.resetDialog();
      }
    },
  },
  methods: {
    resetDialog() {
      this.$emit("reset-dialog");
    },
  }
}
</script>